IDEA Open Model
OpenModel.LoadFromXmlFile Method
Compatible with IDEA StatiCa v 10.1
 Creates the instance of Open Model from the XML file
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public static OpenModel LoadFromXmlFile(
	string xmlFileName
)
Public Shared Function LoadFromXmlFile (
	xmlFileName As String
) As OpenModel
public:
static OpenModel^ LoadFromXmlFile(
	String^ xmlFileName
)
Parameters
xmlFileName
Type: System.String
XML file name
Return Value
Type: OpenModel
Open Model or null
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace